---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.ExtrusionFailures
source: html/9f8038cb-670f-cf03-b7a4-423af7c20a60.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ExtrusionFailures

Failures about Extrusions.

## Syntax (C#)
```csharp
public static class ExtrusionFailures
```